--- a/README.md
+++ b/README.md
@@ -46,60 +60,104 @@ Table of Contents
 
 ### Compilation
 
-```plantuml
-@startuml
-skinparam backgroundColor transparent
-rectangle "Java Source Code (.java)" as R1 
-rectangle "Java Compiler (javac)" as R2
-rectangle "Bytecode (.class)" as R3
-R1 -> R2
-R2 -> R3
-skinparam backgroundColor transparent
-@enduml
+```mermaid
+graph TD
+;
+    R1["Java Source Code _\n(.java)"] --> R2["Java Compiler _\n(javac)"]
+    R2 --> R3["Bytecode _\n(.class)"]
 ```
 
-To compile a Java program, you need to have the Java Development Kit (JDK) installed on your system.
+graph TD;
